import classes from './about.module.scss';
const About = () => {
  const description = [
    {
      id: 1,
      title: '關於Peter Huang',
      content:
        'Hi, 我是Peter! 歡迎來到美麗的寶島-台灣。我在旅遊行業擁有超過30年的豐富經驗，並以其深厚的知識和優秀的服務而受客人喜愛。能夠為旅客提供獨到的觀點和深入的知識。Peter 並不僅僅是一名優秀的司機，還是一位熱情洋溢的導遊。他能夠為您的旅程增色不少，讓您更深入地了解這個美麗的島嶼。作為一個溫和老實的人，Peter Huang 是遊客的理想選擇。他的專業技能和出色的服務態度讓他在業界脫穎而出。無論您是初次造訪台灣還是已經熟悉這個地方，Peter 都能為您提供個人化的旅遊體驗，讓您深入了解台灣的獨特之處。 Peter Huang 也獲得了台灣優秀駕駛者的榮譽，這是對他多年來在道路上的安全駕駛和專業導遊服務的認可。他的承諾是確保您的旅行安全、愉快，同時為您提供深刻的文化和歷史見解。選擇Peter Huang 作為您的台北包車司機，將為您的台灣之旅增添珍貴的回憶。',
    },
    {
      id: 2,
      title: '30年的專業經驗',
      content:
        '我 的自豪之處是我們擁有超過30年的包車旅遊經驗。我們的主司機，黃先生，是我們的驕傲。他不僅具備豐富的駕駛經驗，還是一位充滿親和力、溫和老實的導遊。黃先生對台灣的每一個角落都了如指掌，以獨到的觀點和深入的知識，將為您的旅程增色不少。',
    },
    {
      id: 3,
      title: '優質導遊服務',
      content:
        '我們以熱情和專業的導遊服務著種種不同需求的旅客。無論您是第一次來台灣還是經常訪問，我們都致力於提供定制的旅遊體驗，使您更深入地了解這個美麗的島嶼。',
    },
    {
      id: 4,
      title: '關於我們的承諾',
      content:
        '在我，我們深信旅行是一個豐富的體驗，我們希望為您提供最佳的旅遊體驗。我們將竭盡所能，為您的每一個需求提供專業支持，並確保您的台灣之旅成為一段難以忘懷的冒險。感謝您選擇我，讓我們一起探索台灣的美麗和多樣性！',
    },
  ];
  return (
    <div className={classes.about}>
      <h1>About Us</h1>
      {description.map((e) => {
        return (
          <div key={e.id}>
            <h2>{e.title}</h2>
            <p>{e.content}</p>
          </div>
        );
      })}
    </div>
  );
};

export default About;
